-- Функція AddPrefabPostInit дозволяє нам втрутитися в шаблон (prefab) об'єкта 
-- одразу після того, як гра його завантажила. "beefalo" - це системна назва нашої цілі.
AddPrefabPostInit("beefalo", function(inst)

    -- Перевіряємо, чи цей код виконується на сервері (хості). 
    -- Клієнти (гості) не повинні намагатися змінити характеристики самі собі.
    -- GLOBAL - це глобальне середовище гри, де зберігаються системні змінні.
    if not GLOBAL.TheWorld.ismastersim then
        return
    end

    -- Перевіряємо, чи є у цієї конкретної сутності (inst) компонент здоров'я (health)
    if inst.components.health ~= nil then
        
        -- Звертаємося до компонента здоров'я і застосовуємо функцію встановлення максимального ХП
        inst.components.health:SetMaxHealth(10000)
        
    end
end)